using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace KueObfuscator
{
    class Rnd
    {
        public static int RndInteger()
        {
            return new Random().Next(0, 999999999);
        }


        public static string RndString()
        {
            return new string(Enumerable.Repeat("冤ᦤ液ᦥ冤ᦤ液ᦥ您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用 您好,可以利用冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃.Ｍ.♀.湠.饢.踏.]鈾.涒.儮.鍗.�.~.*鞎.厱.頃橃劯鞎堧厱.頃.橃.劯.鞎.堧.厱.頃.橃ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤ᦤ液ᦥ冤嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩嗉.捽.濃.槵.饢.饢.鉁.剴.鈨.⑩", new Random().Next(900, 2000)).Select(s => s[new Random(Guid.NewGuid().GetHashCode()).Next(s.Length)]).ToArray());
        }

    }
}
